var regionInfo = {
    region_cd: "",
    regionCd : '',
    regn_cd: '',
    addr_cd: '',
    gridx: '',
    gridy: ''
};
var myWater = {
    locationInfo : {},
    myInfoDam : {},
    myInfo : {},
    myWeather : {},
    makeData : {},
    stats : {},
	statsPopup : {},
	myInfoDamAlert: {}
};

var gnbIdx = {
	"menu0" : "나의물",
	"menu1" : "핫이슈",
	"menu2" : "생활",
	"menu3" : "소통",
	"menu4" : "지식",
	"menu5" : "수재해",
	// "menu6" : "실시간",
	"menu7" : "해외"
	// "menu8" : "통계"
};


var oMenu = {
	list : []
};

var realtimeDamType = {
	"sub01/hydr.do": {
		'datepicker': true,
		'selOpts': ['sub1', 'sub3'],
		'sub1': {
			'다목적댐': {
				'소양강댐' : '1012110',
				'충주댐' : '1003110',
				'횡성댐' : '1006110',
				'안동댐' : '2001110',
				'임하댐' : '2002110',
				'합천댐' : '2015110',
				'남강댐' : '2018110',
				'밀양댐' : '2021110',
				'군위댐' : '2008101',
				'대청댐' : '3008110',
				'용담댐' : '3001110',
				'섬진강댐' : '4001110',
				'주암댐' : '4007110',
				'부안댐' : '3303110',
				'보령댐' : '3203110',
				'장흥댐' : '5101110',
				'낙동강하굿둑' : '2022510',
				'김천부항댐' : '2010101',
				'영주댐' : '2004101',
				'성덕댐' : '2002111',
				'보현산댐' : '2012101'
			},
			'용수댐': {
				'광동댐' : '1001210',
				'달방댐' : '1302210', 
				'영천댐' : '2012210',
				'안계댐' : '2101210',
				'감포댐' : '2403201',
				'운문댐' : '2021210', 
				'대곡댐' : '2201231',
				'사연댐' : '2201220', 
				'대암댐' : '2201230', 
				'선암댐' : '2301210', 
				'연초댐' : '2503210', 
				'구천댐' : '2503220', 
				'수어댐' : '4105210', 
				'평림댐' : '5002201'
			},
			'다기능보': {
				'이포보' : '1007603',
				'여주보' : '1007602',
				'강천보' : '1007601',
				'창녕·함안보' : '2017601',
				'합천·창녕보' : '2014602',
				'달성보' : '2014601',
				'강정고령보' : '2011602',
				'칠곡보' : '2011601',
				'구미보' : '2009602',
				'낙단보' : '2009601',
				'상주보' : '2007601',
				'백제보' : '3012602',
				'공주보' : '3012601',
				'세종보' : '3010601',
				'죽산보' : '5004602',
				'승촌보' : '5004601'
			},
			'홍수조절용댐': {
				'평화의댐' : '1009710',
				'한탄강댐' : '1022701',
				'군남댐' : '1021701'
			},
			'홍수조절용댐': {
				'담양홍수조절지' : '5001701',
				'화순홍수조절지' : '5003701',
				'여주저류지' : '1007701'
			}
		},
		'sub3':{
			'10분별': 'C',
			'시간별': 'A',
			'일자별': 'B'
		}
	}
}

/**
 * 수재해 - 가뭄 변수
 */
var tidalData;